// 차이점 공부가 목표이기 때문에, GPT를 바탕으로 코드 입력하고 일부만 수정함.

// Array List (값을 표현할 수는 없음. 엣지(+가중치)만 표현)
const graphA_3 = [
    // A B
    //  C
    // 삼각형이라면
    [0,1,1], // A
    [1,0,1], // B
    [0,0,1] // C
]
const graphA_4 = [
    // A B
    // C D
    // 사각형이라면 (대각형 대칭)
    [0,1,1,0], // A
    [1,0,0,1], // B
    [1,0,0,1], // C
    [0,1,1,0] // D
]
const graphA_4_plus = [
    // A - - B
    // ⎮     ⋮
    // C  -  D
    // 사각형에 가중치를 넣어보면 (대각형 대칭)
    [0,2,1,0], // A
    [2,0,0,3], // B
    [1,0,0,1], // C
    [0,3,1,0] // D
]
const graphA_4_plus_dir = [
    // A - - >B
    // ⎮↑    ⋮↓
    // C < ㅡ D
    // 사각형에 가중치, 방향성을 넣어보면
    [0,2,0,0], // A
    [0,0,0,3], // B
    [1,0,0,0], // C
    [0,0,1,0] // D
]
const graphA_5 = [
    //  A B
    // C   D
    //   E
    // 오각형이라면 (대각형 대칭)
    [0,1,1,0,0], // A
    [1,0,0,1,0], // B
    [1,0,0,0,1], // C
    [0,1,0,0,1], // D
    [0,0,1,1,0] // E
]

// Linked List